//This file is used for internalization and localization.

//In terminal in project directory write: genstrings -SwiftUI *.swift
//This will automatically go through swift files and look for strings and translate it.

/* GENERAL STRINGS */

"OK" = "확인";
"Delete" = "지우기";
"Basic settings" = "기본 설정";



/* MAIN ACTIVITIES */

"Home" = "홈";
"Open" = "열기";
"Closed" = "닫기";
"Awards" = "어워즈";



/* HOME VIEW */

"Up next" = "앞으로 해야할 일";
"More to explore" = "더 알아보기";



/* PROJECTS VIEW */

"Open Projects" = "프로젝트 열기";
"Closed Projects" = "프로젝트 닫기";
"Add Project" = "프로젝트 추가";
"Add New Item" = "아이템 추가";
"There's nothing here right now" = "여기엔 아무것도 없어요";

/* A button that shows a menu with the following options */
"Sort" = "정렬";
"Sort items" = "아이템 정렬"; /* The title of the menu */
"Optimized" = "최적화"; /* Sort using an optimized algorithm */
"Creation Date" = "생성일별 정렬"; /* Sort by the date items were created */
"Title" = "제목별 정렬"; /* Sort by item title */

/* Default names for a new project and a new item */
"New Project" = "새로운 프로젝트";
"New Item" = "새로운 아이템";



/* EDITING PROJECTS */
"Edit Project" = "프로젝트 수정";
"Project name" = "프로젝트 이름";
"Description of this project" = "프로젝트 설명";
"Custom project color" = "프로젝트 색깔";

/* Options to close (mark as finished), open (mark as unfinished), or delete a project. */
"Close this project" = "이 프로젝트 닫기";
"Closing a project moves it from the Open to Closed tab; deleting it removes the project entirely." = "프로젝트를 닫으면 닫기 탭으로 이동됩니다; 지우기는 프로젝트 전체를 삭제합니다";
"Reopen this project" = "이 프로젝트 다시 열기";
"Delete this project" = "이 프로젝트 지우기";
"Delete project?" = "프로젝트를 지울까요?";
"Are you sure you want to delete this project? You will also delete all the items it contains." = "이 프로젝트를 지우길 원하나요? 프로젝트 안에 아이템들도 모두 삭제됩니다.";



/* EDITING ITEMS */
"Edit Item" = "아이템 수정";
"Item name" = "아이템 이름";
"Description" = "설명";
"Priority" = "우선순위";
"Low" = "낮음";
"Medium" = "중간";
"High" = "높음";

"Mark Completed" = "완료 표시하기"; /* Mark this item as being completed (finished/accomplished) */



/* AWARDS */

"Locked" = "잠김";
"Unlocked: %@" = "잠금해제: %@";



/* OTHER STRINGS */

/* Shown by default when the user hasn't select a project or item */
"Please select something from the menu to begin." = "시작하시려면 메뉴에서 선택하여주세요.";
